In [66]:
import pandas as pd
import sqlite3

# Load CSV files
drivers = pd.read_csv("/kaggle/input/day-17-datasets/day_17_drivers.csv")
trips = pd.read_csv("/kaggle/input/day-17-datasets/day_17_trips.csv")

# Create SQLite in-memory database
conn = sqlite3.connect(":memory:")

drivers.to_sql("drivers", conn, index=False, if_exists="replace")
trips.to_sql("trips", conn, index=False, if_exists="replace")

18

In [67]:

pd.read_sql("SELECT * FROM drivers", conn)

   driver_id     name       city  rating
0          1     Aman      Delhi     4.8
1          2     Ritu     Mumbai     4.6
2          3    Kunal       Pune     4.7
3          4    Sneha      Delhi     4.9
4          5   Vikram  Bangalore     4.5
5          6  Pallavi     Mumbai     4.4
6          7    Rohit    Chennai     4.3
7          8   Neelam      Delhi     4.7
8          9    Arjun       Pune     4.6
9         10    Megha  Bangalore     4.8

In [68]:
pd.read_sql("SELECT * FROM trips", conn)

    trip_id  driver_id  distance_km  fare month
0       401          1           12   240   Jan
1       402          1            8   160   Feb
2       403          2            5   120   Jan
3       404          2           10   200   Feb
4       405          2            7   140   Mar
5       406          3            6   180   Jan
6       407          3            9   270   Mar
7       408          4           15   375   Feb
8       409          4           11   275   Mar
9       410          5            4   100   Jan
10      411          5            6   150   Feb
11      412          6            3    75   Jan
12      413          7            5   125   Feb
13      414          8           10   250   Jan
14      415          8           12   300   Mar
15      416          9            7   175   Feb
16      417         10            9   225   Jan
17      418         10            6   150   Mar

In [69]:
#code syntax pattern

pd.read_sql("""
SELECT *
FROM drivers;
""", conn)

   driver_id     name       city  rating
0          1     Aman      Delhi     4.8
1          2     Ritu     Mumbai     4.6
2          3    Kunal       Pune     4.7
3          4    Sneha      Delhi     4.9
4          5   Vikram  Bangalore     4.5
5          6  Pallavi     Mumbai     4.4
6          7    Rohit    Chennai     4.3
7          8   Neelam      Delhi     4.7
8          9    Arjun       Pune     4.6
9         10    Megha  Bangalore     4.8

# ðŸŸ¢ Level 1 â€” Easy (Warm-up)

**Show all drivers and their cities.**

In [70]:
pd.read_sql("""

SELECT t.driver_id, d.name, d.city
FROM drivers d
JOIN trips t
ON t.driver_id = d.driver_id ;
""", conn)

    driver_id     name       city
0           1     Aman      Delhi
1           1     Aman      Delhi
2           2     Ritu     Mumbai
3           2     Ritu     Mumbai
4           2     Ritu     Mumbai
5           3    Kunal       Pune
6           3    Kunal       Pune
7           4    Sneha      Delhi
8           4    Sneha      Delhi
9           5   Vikram  Bangalore
10          5   Vikram  Bangalore
11          6  Pallavi     Mumbai
12          7    Rohit    Chennai
13          8   Neelam      Delhi
14          8   Neelam      Delhi
15          9    Arjun       Pune
16         10    Megha  Bangalore
17         10    Megha  Bangalore

**Show all trips where the fare is greater than 200.**

In [71]:
pd.read_sql("""

SELECT *
FROM trips
WHERE fare > 200 ;
""", conn)

   trip_id  driver_id  distance_km  fare month
0      401          1           12   240   Jan
1      407          3            9   270   Mar
2      408          4           15   375   Feb
3      409          4           11   275   Mar
4      414          8           10   250   Jan
5      415          8           12   300   Mar
6      417         10            9   225   Jan

**Show drivers who belong to the city "Delhi".**

In [72]:
pd.read_sql("""

SELECT d.name, d.city, t.driver_id
FROM drivers d
JOIN trips t ON t.driver_id = d.driver_id
WHERE city = "Delhi" ;
""", conn)

     name   city  driver_id
0    Aman  Delhi          1
1    Aman  Delhi          1
2   Sneha  Delhi          4
3   Sneha  Delhi          4
4  Neelam  Delhi          8
5  Neelam  Delhi          8

**Show all trips that happened in the month of "Jan".**

In [73]:
pd.read_sql("""

SELECT t.trip_id, d.name, t.fare, t.month
FROM trips t
JOIN drivers d ON t.driver_id = d.driver_id
WHERE month = "Jan" ;

""", conn)

   trip_id     name  fare month
0      401     Aman   240   Jan
1      403     Ritu   120   Jan
2      406    Kunal   180   Jan
3      410   Vikram   100   Jan
4      412  Pallavi    75   Jan
5      414   Neelam   250   Jan
6      417    Megha   225   Jan

# ðŸŸ¡ Level 2 â€” JOIN Practice

**Show driver name and fare for each trip.**

In [74]:
pd.read_sql("""

SELECT t.trip_id, d.name, t.fare
FROM drivers d
JOIN trips t ON d.driver_id = t.driver_id
;
""", conn)

    trip_id     name  fare
0       401     Aman   240
1       402     Aman   160
2       403     Ritu   120
3       404     Ritu   200
4       405     Ritu   140
5       406    Kunal   180
6       407    Kunal   270
7       408    Sneha   375
8       409    Sneha   275
9       410   Vikram   100
10      411   Vikram   150
11      412  Pallavi    75
12      413    Rohit   125
13      414   Neelam   250
14      415   Neelam   300
15      416    Arjun   175
16      417    Megha   225
17      418    Megha   150

**Show driver name, city, and fare for each trip.**

In [75]:
pd.read_sql("""

SELECT t.trip_id, d.name, d.city, t.fare
FROM drivers d
JOIN trips t 
ON d.driver_id= t.driver_id ;
""", conn)

    trip_id     name       city  fare
0       401     Aman      Delhi   240
1       402     Aman      Delhi   160
2       403     Ritu     Mumbai   120
3       404     Ritu     Mumbai   200
4       405     Ritu     Mumbai   140
5       406    Kunal       Pune   180
6       407    Kunal       Pune   270
7       408    Sneha      Delhi   375
8       409    Sneha      Delhi   275
9       410   Vikram  Bangalore   100
10      411   Vikram  Bangalore   150
11      412  Pallavi     Mumbai    75
12      413    Rohit    Chennai   125
13      414   Neelam      Delhi   250
14      415   Neelam      Delhi   300
15      416    Arjun       Pune   175
16      417    Megha  Bangalore   225
17      418    Megha  Bangalore   150

**Show all drivers who have completed at least one trip.**

In [76]:
pd.read_sql("""

SELECT DISTINCT d.name
FROM trips t
JOIN drivers d
ON t.driver_id = d.driver_id ;
""", conn)

      name
0     Aman
1     Ritu
2    Kunal
3    Sneha
4   Vikram
5  Pallavi
6    Rohit
7   Neelam
8    Arjun
9    Megha

**Show drivers who have never completed a trip (LEFT JOIN required).**

In [77]:
pd.read_sql("""

SELECT d.name
FROM drivers d
LEFT JOIN trips t 
ON d.driver_id = t.driver_id
WHERE t.trip_id IS NULL ;
""", conn)

Empty DataFrame
Columns: [name]
Index: []

# ðŸŸ  Level 3 â€” JOIN + GROUP BY

**Show total earnings per driver.**

In [78]:
pd.read_sql("""

SELECT d.name, SUM(fare) as total_earnings
FROM drivers d
JOIN trips t
ON d.driver_id = t.driver_id
GROUP BY d.name
;
""", conn)

      name  total_earnings
0     Aman             400
1    Arjun             175
2    Kunal             450
3    Megha             375
4   Neelam             550
5  Pallavi              75
6     Ritu             460
7    Rohit             125
8    Sneha             650
9   Vikram             250

**Show total revenue generated per city.**

In [79]:
pd.read_sql("""

SELECT d.city,  SUM(t.fare) as total_earnings
FROM drivers d
JOIN trips t
ON d.driver_id = t.driver_id
GROUP BY d.city
;
""", conn)

        city  total_earnings
0  Bangalore             625
1    Chennai             125
2      Delhi            1600
3     Mumbai             535
4       Pune             625

**Show number of trips completed by each driver.**

In [80]:
pd.read_sql("""

SELECT d.name, COUNT(*) as no_of_trips
FROM drivers d
JOIN trips t
ON d.driver_id = t.driver_id
GROUP BY d.name
;
""", conn)

      name  no_of_trips
0     Aman            2
1    Arjun            1
2    Kunal            2
3    Megha            2
4   Neelam            2
5  Pallavi            1
6     Ritu            3
7    Rohit            1
8    Sneha            2
9   Vikram            2

# ðŸ”µ Level 4 â€” CASE WHEN Practice

**For each trip, show trip_id, fare and label it: "High Fare" if fare â‰¥ 250 "Low Fare" otherwise**

In [81]:
pd.read_sql("""

SELECT t.trip_id, t.fare, 
    CASE
        WHEN fare >= 250 THEN "High Fare"
        ELSE "Low fare"
    END AS fare_type
FROM trips t
;
""", conn)

    trip_id  fare  fare_type
0       401   240   Low fare
1       402   160   Low fare
2       403   120   Low fare
3       404   200   Low fare
4       405   140   Low fare
5       406   180   Low fare
6       407   270  High Fare
7       408   375  High Fare
8       409   275  High Fare
9       410   100   Low fare
10      411   150   Low fare
11      412    75   Low fare
12      413   125   Low fare
13      414   250  High Fare
14      415   300  High Fare
15      416   175   Low fare
16      417   225   Low fare
17      418   150   Low fare

**For each driver, show name, total earnings, and label: "Top Earner" if earnings â‰¥ 600 "Average Earner" if earnings between 300â€“599 "Low Earner" otherwise**

In [82]:
pd.read_sql("""

SELECT d.name, SUM(t.fare) AS total_earnings, 
    CASE
        WHEN SUM(t.fare) >= 600 THEN "Top earner"
        WHEN SUM(t.fare) >= 300 THEN "Average Earner"
        ELSE "Low Earner"
    END AS earner_type
FROM drivers d
JOIN trips t
ON d.driver_id = t.driver_id 
GROUP BY d.name
;
""", conn)

      name  total_earnings     earner_type
0     Aman             400  Average Earner
1    Arjun             175      Low Earner
2    Kunal             450  Average Earner
3    Megha             375  Average Earner
4   Neelam             550  Average Earner
5  Pallavi              75      Low Earner
6     Ritu             460  Average Earner
7    Rohit             125      Low Earner
8    Sneha             650      Top earner
9   Vikram             250      Low Earner

**For each city, show city, total revenue, and label: "High Revenue" if revenue â‰¥ 700 "Developing City" otherwise**

In [83]:
pd.read_sql("""

SELECT d.city, SUM(t.fare) AS total_revenue, 
    CASE
        WHEN SUM(t.fare) >= 700 THEN "High Revenue"
        ELSE "Developing city"
    END AS city_type
FROM drivers d
JOIN trips t
ON d.driver_id = t.driver_id 
GROUP BY d.city
;
""", conn)

        city  total_revenue        city_type
0  Bangalore            625  Developing city
1    Chennai            125  Developing city
2      Delhi           1600     High Revenue
3     Mumbai            535  Developing city
4       Pune            625  Developing city